import { supabaseUrl } from "../services/supabase";

const imageUrl = `${supabaseUrl}/storage/v1/object/public/cabin-images/`;

export const cabins = [
  {
    name: "کلبه سپیده",
    maxCapacity: 2,
    regularPrice: 250,
    discount: 0,
    image: imageUrl + "cabin-001.jpg",
    description:
      "تجربه‌ای بی‌نظیر از آرامش و لوکس بودن برای زوج‌ها در کلبه چوبی گرم و دنج سپیده. در دل جنگلی چشم‌نواز، این کلبه زیبا یک خلوتگاه عاشقانه و خصوصی را برای شما فراهم می‌کند. فضای داخلی با چوب‌های باکیفیت، نشیمن راحت، شومینه و آشپزخانه‌ای مجهز تزئین شده است. تخت کینگ‌سایز با ملحفه‌های نرم و مرغوب، خوابی آسوده را تضمین می‌کند. دوش اسپا و تراس خصوصی با جکوزی، مکانی عالی برای استراحت و آرامش شماست.",
  },
  {
    name: "کلبه آرام",
    maxCapacity: 2,
    regularPrice: 350,
    discount: 25,
    image: imageUrl + "cabin-002.jpg",
    description:
      "به طبیعت پناه ببرید و در لوکس‌ترین حالت در کلبه دنج آرام، آسودگی را تجربه کنید. مناسب برای زوج‌هایی که به دنبال خلوتی رمانتیک در قلب جنگل هستند. فضای داخلی با چوب باکیفیت، نشیمن گرم و دل‌نشین، شومینه و آشپزخانه‌ای مجهز طراحی شده است. اتاق خواب مجلل با تخت کینگ‌سایز و دوش اسپا کامل می‌شود. تراس خصوصی با جکوزی، فرصتی برای تماشای زیبایی‌های طبیعت است.",
  },
  {
    name: "کلبه خانواده",
    maxCapacity: 4,
    regularPrice: 300,
    discount: 0,
    image: imageUrl + "cabin-003.jpg",
    description:
      "تجربه زندگی خانوادگی لوکس در کلبه چوبی متوسط خانواده، مناسب برای خانواده‌های حداکثر ۴ نفره. این کلبه فضای گرم، راحت و مجهز به امکانات مدرن را ارائه می‌دهد. فضای داخلی از چوب باکیفیت، نشیمن دل‌نشین، شومینه و آشپزخانه‌ای مجهز تشکیل شده است. اتاق‌ها دارای تخت‌های راحت و سرویس بهداشتی به سبک اسپا هستند. تراس خصوصی با جکوزی و فضای نشیمن بیرونی، مکان ایده‌آل برای لذت بردن از طبیعت است.",
  },
  {
    name: "کلبه نیلوفر",
    maxCapacity: 4,
    regularPrice: 500,
    discount: 50,
    image: imageUrl + "cabin-004.jpg",
    description:
      "تعطیلاتی لوکس و خانوادگی را در کلبه نیلوفر تجربه کنید. این کلبه برای خانواده‌های حداکثر ۴ نفر طراحی شده و پناهگاهی مجلل برای سفرهای خاص به شمار می‌رود. فضای داخلی با چوب‌های بسیار مرغوب، نشیمن راحت، شومینه و آشپزخانه‌ای مدرن و مجهز طراحی شده است. اتاق‌ها با تخت‌های نرم و حمام‌های به سبک اسپا تکمیل می‌شوند. در تراس خصوصی با جکوزی شخصی، از زیبایی‌های طبیعی لذت ببرید.",
  },
  {
    name: "کلبه باران",
    maxCapacity: 6,
    regularPrice: 350,
    discount: 0,
    image: imageUrl + "cabin-005.jpg",
    description:
      "در کلبه وسیع و راحت باران، سفری دل‌نشین را با خانواده یا گروه دوستان خود تجربه کنید. طراحی‌شده برای اقامت حداکثر ۶ نفر، این کلبه یک خلوتگاه آرام در دل طبیعت فراهم می‌آورد. فضای داخلی شامل چوب‌های گرم و دل‌نشین، نشیمن با شومینه، و آشپزخانه‌ای مجهز است. اتاق‌ها راحت بوده و دارای حمام اختصاصی هستند. در تراس خصوصی با جکوزی، از مناظر طبیعی نهایت لذت را ببرید.",
  },
  {
    name: "کلبه شاهانه",
    maxCapacity: 6,
    regularPrice: 800,
    discount: 100,
    image: imageUrl + "cabin-006.jpg",
    description:
      "با خانواده یا دوستان خود، تجمل واقعی را در کلبه چوبی شاهانه تجربه کنید. طراحی‌شده برای اقامت راحت ۶ نفر، این کلبه مکانی باشکوه در دل طبیعت فراهم می‌آورد. فضای داخلی با چوب‌های مرغوب، نشیمن بزرگ با شومینه، و آشپزخانه‌ای مجهز به سبک گورمه طراحی شده است. اتاق‌خواب‌ها دارای تخت‌های نرم و حمام‌های به سبک اسپا هستند. تراس خصوصی با جکوزی، مکانی عالی برای استراحت در دل طبیعت است.",
  },
  {
    name: "کلبه کهکشان",
    maxCapacity: 8,
    regularPrice: 600,
    discount: 100,
    image: imageUrl + "cabin-007.jpg",
    description:
      "برای گروه‌های بزرگ یا چند خانواده، کلبه چوبی کهکشان گزینه‌ای عالی است. با ظرفیت ۸ نفر، این کلبه در دل جنگل‌ها و کوه‌ها قرار گرفته و محیطی آرام و خصوصی را فراهم می‌کند. فضای داخلی شامل چندین نشیمن با شومینه، چوب‌های مرغوب و آشپزخانه‌ای مجهز است. اتاق‌ها دارای حمام اختصاصی هستند و تراس خصوصی با جکوزی و فضای نشیمن بیرونی، مکانی مناسب برای لذت بردن از مناظر طبیعی است.",
  },
  {
    name: "کلبه افق",
    maxCapacity: 10,
    regularPrice: 1400,
    discount: 0,
    image: imageUrl + "cabin-008.jpg",
    description:
      "لوکس‌ترین و باشکوه‌ترین تجربه اقامت گروهی را در کلبه افق تجربه کنید. این کلبه با ظرفیت ۱۰ نفر، پناهگاهی فاخر با طراحی ظریف و استفاده از بهترین متریال‌هاست. فضای داخلی شامل چند نشیمن بزرگ با شومینه، اتاق ناهارخوری رسمی، و آشپزخانه‌ای حرفه‌ای و مجهز برای سرآشپزهاست. اتاق‌خواب‌ها با تخت‌های راحت و حمام‌های به سبک اسپا طراحی شده‌اند. در تراس اختصاصی با جکوزی لوکس و فضای نشیمن وسیع، به طبیعت سلام کنید و لحظاتی ناب را تجربه نمایید.",
  },
];
